{
    "ALevel": {
      "RowData": {
        "Main": "This program was my A-Level Computer Science Project. The purpose of it was to replace the dated rowing monitor found on most common indoor rowing machines as seen in the picture below. Navigating these clunky screens was a pain with the limited screen space and inputs. My program improved upon this software in many ways and made for an overall better indoor rowing experience. RowData was made using Python with the use of Pygame for the GUI.",
        "Login": "This is the first screen when the program is run, it allows you to sign in or create a new account. These accounts will store your individual rowing statistics along with personal best times.",
        "Menu": "After a successful log in or sign up, the user is taken to the main menu. From here, they can choose to just row with no goal; start a custom rowing workout; view their statistics; sign out or quit the program.",
        "Justrow": "This is the display that you will see while you are rowing, it displays all the information most people would want in a large font to make it as clear as possible.",
        "Summary": "When the user presses 'Save & Exit', a summary of their row is displayed detailing various averages and totals.",
        "Pb": "If a user selects 'CUSTOM ROW' from the main menu, they are prompted to select a set distance or time. If the user has complete this set distance or time before, their personal best is displayed at the bottom of the screen along with their current row. Enabling them to effectively race against their personal best."
      }
    },
    "Personal": {
      "Discord_Bot": {
        "a": "Discord is a free communication platform that lets you chat in both text and voice calls. It also provides an API allowing you to create Discord server bots. These bots are automated users that perform actions assigned to them by the developer.",
        "b": "This bot provides various commands and features for both admins and users of selected Discord Servers, these Servers are all part of an online sim-racing community known as EERC (European E-Racing Community). It is programmed in JavaScript and runs in Node.js. Below are just a few examples of what this bot is able to do.",
        "Reminders": "Reminders can be set for someone else in the server or yourself, the user is then notified with the message after the pre-determined delay. It is also possible to notify a user at a certain time of day (e.g 14:00).",
        "Weather": "The Weather can play a large part in an online race, it can be advantageous to know the weather beforehand. Therefore, we needed a fair and slightly random way of configuring the weather settings for a race. This command uses the percentage chance of rain during the race along with an element of randomness to output the weather settings for the race, this weather can include: clear skies, light cloud, overcast, light rain and rain.",
        "Stats": "This command displays statistics on the user's activity on all servers with the bot. The first picture shows their average number of messages sent on each day of the week on each server. The second displays their average number of messages sent each hour of the day on each server. Lastly, the third displays the top 10 chat channels the user is active in.",
        "Roles": "Discord Roles enable you to categories and set permissions for users in the server. For example, British users get the British role. These commands below allow the user to assign their own roles rather than an admin assigning it, this is especially useful in larger servers with lots of people wanting various roles.",
        "TTS": "Using Google's text to speech API, this bot will read aloud messages to users in a voice channel. This is used when penalties are announced to those driving during an online endurance race."
      },
      "Website": {},
      "Rally_Results_Reader": "This program uses OCR to read results from a screenshot and converts them to a CSV file. These results come from the website of a rally driving simulator called 'DiRT Rally 2.0'. An online weekly championship is hosted on this website whereby each driver has a week to complete a section of the game as fast as possible with no resets allowed."
    },
    "First_Year": {
      "Countdown_Simulator": {
        "a": "This was my first programming coursework at University, it is a simulated game of Countdown from a command-line interface.",
        "b": "The user is prompted 9 times to choose either a vowel or a consonant using the letters 'v' and 'c' as inputs. A random letter depending on their input is added to a list using the same probability distribution from the Countdown show.  The 9 letters for this function will be returned as a string.",
        "c": "A list of words is created from 'words.txt' with punctuation removed and words less than 10 letters long. The argument for this function is expected to be the name of a text file as a string. The words will then be returned as a list.",
        "d": "The next function will take the 9 letter string and return two lists. The first being all possible words that can be made from those 9 letters and the second being the longest words that can be made.",
        "e": "The last main function asks the user to input their best guess as well as being given the chance to shuffle the letters. Their input is checked against all possible words to see if there is a match. If there is the program will print out: the number of points scored, statistics on how 'good' their word was, if they scored maximum points and lastly a list of the longest words.",
        "WDIL": "As this was the first programming coursework, the actual python code and overall logic of the program was relatively simple. However, it did teach me how to format code correctly using a pre-determined style. This included documentation such as comments and doc strings."

      },
      "Smart_Alarm_Clock": {
          "Main": "This program is a smart alarm clock intended to be run 24/7. It enables the user to schedule, edit and cancel alarms. The user is notified when an alarm is up via an alarm sound, text to speech and a notification which is displayed in the notifications column. The user is also notified when the weather in the location selected has changed and when there is a new news story. The web page will automatically refresh every 5 minutes to keep the notifications, weather and news up to date on screen.",
          "Notifications": "This module is responsible for all notification functionality. It displays the latest notifications in the centre column on the webpage ordered by time. The user can clear the notifications or filter the displayed notifications from three categories: alarms, weather and news.",
          "Alarms": "This module is responsible for all alarm functionality. The user can add new alarms with the two optional options. First, they can select days of the week for the alarm to repeat on. Secondly, an alarm label which is displayed in notifications and read out to the user when the alarm goes off along with an alarm sound. The alarm is also logged when it goes off along with the appropriate data. The user edit the time of a regular alarm or repeating alarm once it's been set and delete alarms.",
          "News": "This module is responsible for all news functionality. It uses newsapi to fetch the latest news stories every 60 seconds",
          "Weather": "This module is responsible for all weather functionality. It uses openweathermap to fetch the current weather in the given location every 30 seconds. This data is then displayed on the main page. A notification is sent each time weather has been fetched and some data has changed, this is also logged. The user can change the location of the weather with the name of a Town or City.",
          "WDIL": "This coursework was the first time I had used the Python library 'Flask' (a micro web application framework); This furthered my knowledge in HTTP methods such as GET and POST along with building a simple web layout with HTML and CSS."
      },
      "Barnabys_Brewhouse": {
        "Main": "This program provides multiple features to make processing beer and decision making easier for Barnaby's Brewhouse. This is achieved through python and basic html/css using the flask library to display a web interface.",
        "Batch_Management": "This module is responsible for handling the creation, movement and termination of batches created from the user interface. It allows the user to upload a new batch of beer with the choice of a tank preference and if not the most suitable tank is automatically picked displaying all batches currently being processed.",
        "Tank_Management": "This module is responsible for fetching the status of each tank. The status of each tank is then displayed with details of the batch inside each tank.",
        "Inventory": "This module handles fetching the inventory from the json file and updating the inventory when a manual update is requested. The inventory is then displayed for each beer enabling them to update the stock manually in case beers are returned or other unforeseen circumstances.",
        "Order_Management": "This module is responsible for handling customer orders inputted by the user via the user interface. It allows the user to upload sales data to be used to influence the planning decisions on which beer to brew next with reasoning.",
        "Beer_Suggestion": "This module is responsible for suggesting the type of beer that should be produced. A score for each beer type is accumulated through the module and the highest score is the beer that is suggested next.",
        "Sales_Predictions": "This module is responsible for predicting the demand of each beer type for a month of sales 3 months from the current date. The average growth and sales from the same month in the previous years are used to calculate this prediction.",
        "WDIL": "This coursework introduced me to logging actions that occur in your program, this was done using the Python library 'logging'. Although this was required for the coursework, I also found it very useful for debugging certain issues with the program."
      },
      "Beanbag_Store": {
        "Main": "This assignment was a pair-programming project based around the development of a back-end Java package. This package was to be used by a client who have determined what they require of the system including an interface. They also already have the front-end developed. This back-end will enable them to: manage stock such as adding beanbags and setting their price; selling beanbags; reserving beanbags for customers and retrieve information such as the total price of the beanbags sold.",
        "FB": "\"An excellent submission with very few issues at all. Code is commented clearly, but not excessively, and there are no points in code where you cannot easily tell what is going on.\"",
        "WDIL": "This was the first project I had done in Java. During development, I felt I improved my understanding of Object Orientated Programming as a whole as well as Java semantics."
      },
      "Task_Manager": {
        "Main": "This coursework was a section of my Web Development module. The main page allows the user to each manage their own tasks. From editing tasks, marking tasks as complete and deleting tasks.",
        "Log_In": "The log in screen requires a username and a password. The username and hashed password with salt and pepper is looked up in a database. Appropriate error messages are displayed to the user when an unsuccessful log in occurs.",
        "Sign_Up": "This page is intended for new users with much of the code similar to that of the log in page. The main differences are checking if the username already exists in the database and checking the two passwords the users has entered match. If it's successful, they are taken to the home page and their details are added to the database.",
        "New_Task": "Here the user can create a new task which includes a title, description and a due date. This task is added to the database and they are returned to the home page with their new task added to the table displayed.",
        "Import_Export_Tasks": "This allowed the user to import and export tasks to and from a shared database of tasks using an API. Imported tasks were then added to the database as if they had created them with the 'New Task' page.",
        "FB": "\"The core features all work well. The styling is good but not responsive. You should use media queries to ensure the webpage is responsive to different screen sizes. All user requirements are fulfilled. Passwords are being stored correctly and users are redirected as expected but there are some security holes. Some SQL expressions are not secure and open the website up to a SQL injection attack. The client side javascript is correct. The website architecture is good but not MVC. The website has been integrated correctly into the web service.\"",
        "WDIL": "This coursework improved my knowledge of basic web design and styling; the use of a database alongside a website and the use of SOAP APIs. This was also my first (and hopefully last) time using PHP to create a website."
      },
      "Lift_Algorithm": {
        "Main": "The idea of this coursework was to design and implement an algorithm for a lift using data structures we had learnt in the module. This algorithm would then be compared against a base algorithm which also had to be implemented. These algorithms dictated where the lift would go in order to serve random requests from one floor to another.",
        "Settings": "The settings page allowed you to configure the total number of floors; the spawn rate of new requests and the speed the lift traveled between floors.",
        "Base_Algorithm": "The design of this base algorithm was provided; however, we still had to implement it into our program. The lift starts from the bottom floor and continually travels to the top floor and back down to the ground floor, picking up requests if they are heading the same direction as the lift and the lift is not full. Each time a floor is reached, those requests inside the lift who's destination is the current floor are removed from the lift.",
        "Improved_Algorithm": "For the improved algorithm, the lift starts from the bottom floor. While there are no requests on any floor or in the lift, the lift will travel to the middle floor and wait there for requests to be in the optimal position pending a new request on a random floor. When a request spawns and the lift is empty, the lift will travel to the request that has been waiting the longest picking up any requests heading in the same direction as the lift. The lift will then travel to the destination floor of that request also picking up any heading in the same direction as the lift.",
        "FB": "\"Good video with size-by-side comparison of base and improved lift. Good report, statistics, and detailed logs, but report would have benefited from more detailed description of the problem, baseline lift, cost metrics, etc. Code style and comments are good, but there are lots of global variables (avoid these where possible), some functions do not have parameters specified in docstring. Code required me to install pygame which was not specified in a Readme. UI is good, but could be improved by allowing the user to simulate without graphics so they do not always have to wait, and allowing the user to change the distribution of passengers e.g. top/bottom-heavy distributions.\"",
        "WDIL": "This coursework was the first time I had to implement threading into a project and ended up being relatively simple in Python. This allowed for the creation of people requesting to use the lift to process on a separate thread."
      }
    },
    "Second_Year": {
      "Card_Game": {
        "Main": "This coursework was a pair-programming exercise. We developed in Java, a multi-threaded card playing simulation. Within the design we implemented a thread-safe Card class, Card Deck, and a Player class. The program then runs from the executable CardGame class.",
        "WDIL": "The module as a whole including this coursework gave me a greater understanding on threading. It also taught me how to create multi-threaded programs more complex than very basic multi-threaded examples."
      },
      "Functional_Programming": {
        "Question_1_1": "The aim of the first question was to create a haskell program that could validate answers and find all solutions to the following puzzle. A puzzle requires one to find six-digit numbers where:",
        "Question_1_2": "All digits are different.",
        "Question_1_3": "Alternate digits are even and odd, or odd and even.",
        "Question_1_4": "Alternate digits differ by more than two.",
        "Question_1_5": "The first and middle pairs of digits form numbers that are both multiples of the last.",
        "Question_2_1": "The second question was based on simulating the 'Game of Life'. The late John Conway was a mathematician who became known outside the world of mathematics for his invention of the Game of Life. The game involves configuring a cellular automaton and then observing how it evolves according to three rules. The cells are organised as a two-dimensional grid, and are either live or dead. The three rules of evolution are:",
        "Question_2_2": "Any live cell with two or three live neighbours survives.",
        "Question_2_3": "Any dead cell with three live neighbours becomes alive.",
        "Question_2_4": "All other live cells die, and all other dead cells stay dead",
        "Question_2_5": "The next generation is created by applying the rules simultaneously to every cell in the current generation, so that births and deaths occur simultaneously.",
        "WDIL": "This was both the first time using Haskell and using a functional programming language in general. At first, I found the syntax confusing and hard to use. But after this coursework I was much more confident in writing in Haskell and understanding functional programming."
      },
      "Logical_Programming": {
        "Question_1_1": "The first question in this coursework was to create a prolog program that could solve a particular niner puzzle published by the Exeter Express. Each number from 1 to 9 represents a different letter. Solve the clues and insert the letters in the appropriate squares to discover a word which uses all nine letters.",
        "Question_1_2": "452589 — gives an animal",
        "Question_1_3": "658785 — gives a vegetable;",
        "Question_1_4": "7378719 — gives a mineral.",
        "Question_2_1": "The second question was based on a teaser published by The Sunday Times, the teaser is as follows:",
        "Question_2_2": "A four-digit number with different positive digits and with the numbers represented by its last two digits a multiple of the number represented by its first two digits, is called a PAR.",
        "Question_2_3": "A pair of PARs is a PARTY if no digit is repeated and each PAR is a multiple of the missing positive digit.",
        "Question_2_4": "I wrote down a PAR and challenged Sam to use it to make a PARTY. He was successful.",
        "Question_2_5": "I then challenged Beth to use my PAR and the digits in Sam's PAR to make a different PARTY. She too was successful. What was my PAR?",
        "WDIL": "Similar to the previous functional programming coursework, this was both the first time using Prolog and using a logic programming language in general. While working on this coursework, I gained a much stronger understanding of the logic programming paradigm."
      },
      "Unite": {
        "Main": "Unite is a mobile application for designed for students at university. Students would ask questions related to their course and other students on the same course could reply with answers. As gamification was required as part of the specification, a points system was implemented based on the number of questions a student would ask, against the number they would answer. Students could earn badges as they use the app and leaderboards would display the top students answering the most questions.",
        "Feedback_1": "Will always delivers at completing tasks on the board and is great at giving direction to other members of the team.",
        "Feedback_2": "Will demonstrated a fantastic grasp of serverside technologies, and was especially quick at learning new things too.",
        "Feedback_3": "Will set up many of the technologies used and performed many of the technical tasks very well.",
        "WDIL": "This was the first time I had worked in a larger team in an agile software development environment. It was also my first time using React and TypeScript. The deadline for this coursework was very short, so I took control of taking control and delegating tasks in order to complete the coursework on time."
      },
      "Puzzle_Problem": {
        "Main": "The aim of the 8-puzzle is to reach a predefined configuration of tiles from another configuration of tiles. The 8-puzzle problem can be seen as a search problem due to its following attributes. First, the puzzle has discrete states, these different states are dependent on the position of each tile in the puzzle. One tile is missing enabling a tile next to it to move into that position. The puzzle has four operators, the missing tile can either move up, down, left, or down. Also, the puzzle has an end goal, this goal can any one of the possible states the puzzle can be in. In this question, the goal state is to have the missing tile in the top right with the rest of the tiles in ascending order. Lastly, a search problem requires a path cost. In this puzzle, the path cost is equal to one each time a tile is moved into the missing tile space.",
        "Manhattan": "The first heuristic function I have picked is the sum of 'Manhattan' distances each tile is away from its goal position. So the closer the tiles are to their goal position, the smaller the heuristic value gets. It's called the 'Manhattan' distance because it's the number of rows plus the number of columns away from the target rather than a direct distance as the crow flies. I chose this type of distance because it is a better representation of how tiles move in the puzzle and therefore should be a better heuristic.",
        "Euclidean": "The second heuristic function I have picked is the sum of 'Euclidean' distances each tile is away from its goal position. This is similar to the first heuristic but instead the distances are defined as a direct distance as the crow flies. I predict that this heuristic will not perform as well as the first once. I chose this heuristic because I wanted to see if I was correct and if so, how big the solving time is between these two heuristics."
      },
      "Post_Office_Queue": {
        "Main": "The aim of this coursework was to simulate queues at a post office, whereby a single queue of people are waiting for to be served by any of the multiple service points.",
        "FB": "\"The code is ANSI standard. The code has been split up into more than one unit of code. The program correctly traps normal errors (e.g. malloc, file open). The customer queue is implemented as a linked list. Memory allocated using malloc is freed. The command line parameters are successfully processed. I think that is probably the neatest main function I've seen. And the thing that runs the simulation is very tidy indeed.\"",
        "WDIL": "This was my first time using the C programming language. It was also my first time using pointers within a larger system, which greatly helped with my understanding of them and when and where to use them."
      },
      "Vaccine_Ordering": {
        "Main": "The aim of this coursework was to create a customer ordering system for vaccines. The overall design of my system includes classes in separate files to represent single entities of customers, invoices, and orders. There is also a file named 'fileIO' which validates and reads the input file. Lastly, my main function can be found in the file named 'ordering' which also contains other functions such as adding new customers and orders. ",
        "FB": "\"The code successfully compiles and links. The code is C++11 standard. The code has been split up into more than one unit of code. The program correctly traps reasonable normal errors. Well done for spotting that the program can be implemented using the publish/subscribe model. The command line parameters are successfully processed. The input file is successfully processed. A nice report, with a good level of detail.\"",
        "WDIL": "This was my first time using the C++ programming language."
      }
    },
    "Third_Year": {
      "Workout_Planner": {
        "a": "The final product is a resistance training iPhone app with an optional Apple Watch app, both of which are written in Swift. The app contains 20 popular resistance exercises by default, covering all parts of the body. Additionally, users can add their own exercises. Three of the included exercises have exercise analysis features enabled, bicep curl, lateral raise and shoulder press. The form classification models for bicep curl and lateral raise can detect the user exercising with bad range and exercising too fast. For shoulder press, form with bad range can also be detected in addition to detecting when the user is using their legs for momentum. An exercise can be of two types. The traditional repetition exercise where the exercise is completed by repeating a specific motion, or an isometric exercise where a specific body position is held for a duration of time such as a plank or wall sit. Workouts are created by the user configuring its name, a warm-up and/or cool-down, and the sequence of exercises that will be traversed. When adding an exercise to a workout, if it is a repetition exercise, the user may add one or more exercise sets for that exercise configuring the weight and repetition target for each set. If it is an isometric exercise, the user will set the duration of a countdown timer for how long they wish to hold the exercise for. Workouts created on the iPhone automatically sync to the user's Apple Watch. Each exercise and workout created by the user can be edited and deleted within the iPhone app only.",
        "b": "Workouts can be run within the iPhone or Apple Watch app. The user completes an exercise set and presses the arrow buttons to move on to the next exercise set. At any time, the user has the option of pausing the workout or exiting the workout before completing all exercise sets, ensuring the workout progress so far is saved. Running a workout on the Apple Watch has feature parity with the iPhone with additional exercise analysis providing the workout includes at least one exercise with exercise analysis enabled. During an exercise set with an exercise analysis enabled exercise, the Apple Watch will vibrate when the user completes the second to last repetition, signalling they have one repetition remaining. Additionally, when moving to the next exercise set, the user will be alerted of any poor form detected from the previous exercise set and given advice on how to improve. The Apple Watch also provides a 'Just Workout' mode where the user is not constrained to a pre-configured set of exercises. An exercise classifier is used to identify the type of exercise the user is performing. Once identified, the exercise classifier is replaced with the form classifier for that particular exercise, repetitions counting begins and exercise metrics are recorded.",
        "c": "A workout summary is provided when finishing a workout on either the iPhone or Apple Watch. More details are provided if finished on the Apple Watch including the user's average heart rate, calories burnt and a brief insight into the exercise analysis of any exercise analysis enabled exercises included in the workout. Within the iPhone app, a list of workouts completed on both the iPhone and Apple Watch can be viewed. For exercise analysis enabled exercises, the user can view a detailed insight into their performance for each exercise set. Details include the average repetition time, the average range of motion, the percentage of time exercising, and the average time spent in eccentric and concentric motion expressed as a percentage. Users can also view statistics based on previously completed workouts. These include a summary of the last week, month and year's workout activity; pie charts on the most used exercises and body parts exercised; and the user's personal best weight of each exercise they have completed. Lastly, a settings page is available to configure the following: toggle form advice alerts; change the weight unit (kilograms or pounds); set an additional countdown timer before isometric hold exercises to allow yourself to get into position; and change the theme of the iPhone app (system, light or dark).",
        "Summary": "A resistance training iPhone app with an optional Apple Watch app, both of which are written in Swift. The user can create workouts in the iPhone and run those workouts on either the iPhone or Apple Watch app. Exercise form is analysed in real-time using machine learning models created in Python with three of the included exercises, bicep curl, lateral raise and shoulder press. During an exercise set, the Apple Watch will vibrate when the user completes their penultimate repetition of their target number, signalling they have one repetition remaining. Additionally, when moving to the next exercise set, the user will be alerted of any poor form detected from the previous exercise set and given advice on how to improve. When a workout has been completed, the user can view a detailed insight into their performance for each exercise set. Details include the average repetition time, the average range of motion, the percentage of time exercising, and the average time spent in eccentric and concentric motion expressed as a percentage.",
        "FB": "",
        "WDIL": "This project has broadened my understanding of signal processing, enabled me to learn a new programming language in Swift, and how to build apps for the Apple ecosystem."
      },
      "Street_Scene": {
        "Main": "The goal of this coursework was to create a 3D scene that resembled a street. The scene had to be written in Python using OpenGL. Concepts that had to be included are: translation, rotation, local illumination, texture mapping and environmental mapping.",
        "FB": "\"The code works with no error but slightly slow speed to load. The scene contains a comprehensive group of objects resembling a street. It involves lots of creativity, I particularly liked the football field, the merry go round and the idea of windows with lights. The code is well documented and the screen loads with a reasonable speed. Amazing effort and very creative, excellent job!\"",
        "WDIL": "I found this coursework very difficult at first due to not fully understanding the graphics pipeline and difficulty with the OpenGL framework. However, starting from the basics, I was able to slowly build a solution and over time gained a much greater understanding of the graphics pipeline."
      },
      "Spotify_Hit_Predictor": {
        "Main": "For this coursework, we used the tools and techniques learned throughout the module to train machine learning models on a dataset of our choice, and communicate insights we found from the modeling exercise.",
        "WDIL": "This coursework strengthened my understanding of a lot of different aspects of implementing machine learning models in Python. Including data exploration, model selection, feature selection, model parameters and model output analysis."
      },
      "Quickhull_Algorithm": {
        "Main": "This coursework asked us to write a technical report of an algorithm of our choice, implement it using a programming language, and create a video to demonstrate the code and its results.",
        "FB": "\"The results are generally correct, however, more instructions could be provided. The source code uses appropriate data structures. The design of the algorithm is excellent. The layout is clear and the code is logically organised. There are sufficient clear comments.\""
      },
      "Ant_Colony_Optimisation": {
        "Main": "The goal of this coursework was to implement ant colony optimisation for the problem of bin packing. We needed to carry out a variety of experiments to help find out what parameters for the algorithm are best for this problem. The graph through which ants traverse to create a solution can be found below. Ants will traverse from left to right, placing an item in one of the bins for each column.",
        "FB": "\"Good and efficient code. It is well documented. Some useless codes should be deleted instead of commenting.\"",
        "WDIL": "By implementing this algorithm by scratch, this helped me understand the ant colony optimisation algorithm much more. For example, how the each parameter affects the results and how it can be applied to other problems such as scheduling."
      }
    }
  }
